## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 24 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `aws_efs_access_point.weblate_data`                                          |
|        | `aws_efs_backup_policy.weblate_data`                                         |
|        | `aws_efs_file_system.weblate_data`                                           |
|        | `aws_efs_file_system_policy.weblate_data`                                    |
|        | `aws_efs_mount_target.weblate_data[&quot;&quot;]`                                      |
|        | `aws_ssm_parameter.weblate_admin_email`                                      |
|        | `aws_ssm_parameter.weblate_admin_password`                                   |
|        | `aws_ssm_parameter.weblate_github_credentials`                               |
|        | `aws_ssm_parameter.weblate_google_client_id`                                 |
|        | `aws_ssm_parameter.weblate_google_client_secret`                             |
|        | `module.localisation_services.aws_appautoscaling_policy.this[&quot;cpu&quot;]`         |
|        | `module.localisation_services.aws_appautoscaling_policy.this[&quot;memory&quot;]`      |
|        | `module.localisation_services.aws_appautoscaling_target.this[0]`             |
|        | `module.localisation_services.aws_cloudwatch_log_group.this`                 |
|        | `module.localisation_services.aws_ecs_cluster.this[0]`                       |
|        | `module.localisation_services.aws_ecs_cluster_capacity_providers.this[0]`    |
|        | `module.localisation_services.aws_ecs_service.this`                          |
|        | `module.localisation_services.aws_ecs_task_definition.this`                  |
|        | `module.localisation_services.aws_iam_policy.this_task[0]`                   |
|        | `module.localisation_services.aws_iam_policy.this_task_exec`                 |
|        | `module.localisation_services.aws_iam_role.this_task`                        |
|        | `module.localisation_services.aws_iam_role.this_task_exec`                   |
|        | `module.localisation_services.aws_iam_role_policy_attachment.this_task[0]`   |
|        | `module.localisation_services.aws_iam_role_policy_attachment.this_task_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.efs_access_point_secure will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_access_point_secure" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowAccessThroughAccessPoint"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "elasticfilesystem:AccessPointArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.efs_mount will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_mount" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
              + "elasticfilesystem:DescribeMountTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ssm_parameters" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "GetWeblateSSMParameters"
        }
    }

  # aws_efs_access_point.weblate_data will be created
  + resource "aws_efs_access_point" "weblate_data" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all        = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/app/data"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "775"
            }
        }
    }

  # aws_efs_backup_policy.weblate_data will be created
  + resource "aws_efs_backup_policy" "weblate_data" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.weblate_data will be created
  + resource "aws_efs_file_system" "weblate_data" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all                = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + throughput_mode         = "bursting"
    }

  # aws_efs_file_system_policy.weblate_data will be created
  + resource "aws_efs_file_system_policy" "weblate_data" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_efs_mount_target.weblate_data[""] will be created
  + resource "aws_efs_mount_target" "weblate_data" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = [
          + "",
        ]
    }

  # aws_ssm_parameter.weblate_admin_email will be created
  + resource "aws_ssm_parameter" "weblate_admin_email" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-admin-email"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.weblate_admin_password will be created
  + resource "aws_ssm_parameter" "weblate_admin_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-admin-password"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.weblate_github_credentials will be created
  + resource "aws_ssm_parameter" "weblate_github_credentials" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-github-credentials"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.weblate_google_client_id will be created
  + resource "aws_ssm_parameter" "weblate_google_client_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-google-client-id"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.weblate_google_client_secret will be created
  + resource "aws_ssm_parameter" "weblate_google_client_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "weblate-google-client-secret"
      + tags           = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "platform-core-services"
          + "Environment" = "staging"
          + "Product"     = "localisation-services"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.localisation_services.data.aws_iam_policy_document.this_task_combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
        ]
    }

  # module.localisation_services.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.localisation_services.data.aws_iam_policy_document.this_task_exec_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.localisation_services.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/localisation-services/weblate"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.localisation_services.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/localisation-services/weblate"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.localisation_services.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/localisation-services/weblate"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
    }

  # module.localisation_services.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/localisation-services"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
    }

  # module.localisation_services.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "localisation-services"
      + tags     = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.localisation_services.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "localisation-services"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.localisation_services.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "weblate"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name = "weblate"
          + container_port = 4443
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "",
            ]
          + subnets          = [
              + "",
            ]
        }
    }

  # module.localisation_services.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "weblate"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + task_role_arn            = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }

      + volume {
          + name = "efs-app-data"

          + efs_volume_configuration {
              + file_system_id          = (known after apply)
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = (known after apply)
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # module.localisation_services.aws_iam_policy.this_task[0] will be created
  + resource "aws_iam_policy" "this_task" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "weblate_ecs_task_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
    }

  # module.localisation_services.aws_iam_policy.this_task_exec will be created
  + resource "aws_iam_policy" "this_task_exec" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "weblate_ecs_task_exec_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
    }

  # module.localisation_services.aws_iam_role.this_task will be created
  + resource "aws_iam_role" "this_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "weblate_ecs_task_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.localisation_services.aws_iam_role.this_task_exec will be created
  + resource "aws_iam_role" "this_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "weblate_ecs_task_exec_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.localisation_services.aws_iam_role_policy_attachment.this_task[0] will be created
  + resource "aws_iam_role_policy_attachment" "this_task" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "weblate_ecs_task_role"
    }

  # module.localisation_services.aws_iam_role_policy_attachment.this_task_exec will be created
  + resource "aws_iam_role_policy_attachment" "this_task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "weblate_ecs_task_exec_role"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
